Sguan-ZhouQing/Qiansai25_MainCode/项目工程文件/demo_STM32G431code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define DIR1_Pin GPIO_PIN_6
#define DIR1_GPIO_Port GPIOA
#define Stepper1_Pin GPIO_PIN_7
#define Stepper1_GPIO_Port GPIOA
#define DIR2_Pin GPIO_PIN_0
#define DIR2_GPIO_Port GPIOB
#define Stepper2_Pin GPIO_PIN_1
#define Stepper2_GPIO_Port GPIOB
#define CSN_Pin GPIO_PIN_2
#define CSN_GPIO_Port GPIOB
#define Key1_Pin GPIO_PIN_10
#define Key1_GPIO_Port GPIOB
#define Key2_Pin GPIO_PIN_11
#define Key2_GPIO_Port GPIOB
#define Key3_Pin GPIO_PIN_12
#define Key3_GPIO_Port GPIOB
#define Power_Pin GPIO_PIN_8
#define Power_GPIO_Port GPIOA
#define CE_Pin GPIO_PIN_12
#define CE_GPIO_Port GPIOA
#define IRQ_Pin GPIO_PIN_6
#define IRQ_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
